Repository: VYACHESLAV204/newDjangoDefect
Catalog: dojo/locale/*/LC_MESSAGES/django.po
Languages: ru

source: API Key
ru: Ключ API

source: Location of network testing: Examples: VPN, Internet or Internal.
ru: Расположение сетевого тестирования: примеры: VPN, Интернет или Internal.

source: Brief description of preset.
ru: Краткое описание пресета.

source: Description of what needs to be tested or setting up environment for testing
ru: Описание того, что необходимо протестировать или как настроить среду для тестирования

source: Scope of Engagement testing, IP's/Resources/URL's)
ru: Скоуп тестирования Проверки (IP/Ресуры/URL)

source: Version of the product the engagement tested.
ru: Версия продукта тестируемой проверки.

source: Settings and notes for performing this engagement.
ru: Настройки и заметки, необходимые для проведения этой проверки.

source: Link to epic or ticket system with changes to version.
ru: Ссылка на эпиков или задачу с изменениями версии.

source: Build ID of the product the engagement tested.
ru: ID сборки проверки в протестированном продукте.

source: Build ID
ru: ID сборки

source: Commit hash from repo
ru: Хэш коммита из репозитория

source: Commit Hash
ru: Хэш коммита

source: Tag or branch of the product the engagement tested.
ru: Тег или ветка протестированного продукта.

source: Branch/Tag
ru: Ветка/Тег

source: Build Server
ru: Сервер сборки

source: Build server responsible for CI/CD test
ru: Сервер сборки, ответственный за CI/CD тест

source: SCM Server
ru: SCM сервер

source: Source code server for CI/CD test
ru: Сервер исходного кода для CI/CD теста

source: Repo
ru: Репозиторий

source: Resource link to source code
ru: Ссылка на ресурс с исходным кодом

source: Orchestration Engine
ru: Механизм оркестровки

source: Orchestration service responsible for CI/CD test
ru: Сервис оркестрации, отвечающий за проведение CI/CD тестов

source: Deduplication within this engagement only
ru: Дедупликация только в рамках этой проверки

source: If enabled deduplication will only mark a finding in this engagement as duplicate of another finding if both findings are in this engagement. If disabled, deduplication is on the product level.
ru: Если включено deduplication будет означать только вывод в этой проверке как дубликат другого вывода, если оба выводы находятся в этой проверке. Если отключено, происходит дедупликация на уровне продукта.

source: Disable deduplication for this engagement
ru: Отключить дедупликацию для этой проверки

source: If enabled findings will never mark as duplicate in this engagement
ru: Если включено, уязвимости не будут помечаться как дубликаты в этой проверке

source: Use this engagement as reference for deduplication
ru: Использовать эту проверку для дедупликации

source: If enabled findings from other engagements will deduplicate with findings from this engagement
ru: Если включено, уязвимости из других проверок будут дедуплицироваться с уязвимостями из этой проверки

source: Add tags that help describe this engagement. Choose from the list or add new tags. Press Enter key to add.
ru: Добавьте теги, которые помогут описать эту проверку. Выберите из списка или добавьте новые теги. Нажмите клавишу Enter для добавления.

source: Internal use tags sepcifically for maintaining parity with product. This field will be present as a subset in the tags field
ru: Внутреннее использование специфичных тегов для поддержания паритетности продукта. Это поле будет присутствовать как подмножество в поле тегов

source: The communication protocol/scheme such as 'http', 'ftp', 'dns', etc.
ru: Коммуникационный протокол/схема типа 'http', 'ftp', 'dns' и т.д.

source: User info as 'alice', 'bob', etc.
ru: Информация о пользователе как 'alice', 'bob' и т.д.

source: The host name or IP address. It must not include the port number. For example '127.0.0.1', 'localhost', 'yourdomain.com'.
ru: Имя хоста или IP-адрес. Не должно содержаться номера порта. Например, '127.0.0.1', 'localhost', 'yourdomain.com'.

source: The network port associated with the endpoint.
ru: Сетевой порт, связанный с конечной точкой.

source: The location of the resource, it must not start with a '/'. For example endpoint/420/edit
ru: Расположение ресурса не должно начинаться с '/'. Например endpoint/420/edit

source: The query string, the question mark should be omitted.For example 'group=4&team=8'
ru: Строка запроса, знак вопроса должен быть опущен. Например, 'group=4&team=8'

source: The fragment identifier which follows the hash mark. The hash mark should be omitted. For example 'section-13', 'paragraph-2'.
ru: Идентификатор фрагмента, который следует за хэш-меткой. Хэш-метку следует пропускать. Например «section-13», «paragraph -2».

source: Findings
ru: Уязвимости

source: Add tags that help describe this endpoint. Choose from the list or add new tags. Press Enter key to add.
ru: Добавьте теги, которые помогут описать эту конечную точку. Выберите из списка или добавьте новые теги. Нажмите клавишу Enter для добавления.

source: SonarQube issue key
ru: Ключ задачи SonarQube

source: SonarQube issue status
ru: Статус задачи SonarQube

source: SonarQube issue type
ru: Тип проблемы SonarQube

source: Add tags that help describe this test. Choose from the list or add new tags. Press Enter key to add.
ru: Добавьте теги, которые помогут описать этот тест. Выберите из списка или добавьте новые теги. Нажмите клавишу Enter для добавления.

source: Build ID that was tested, a reimport may update this field.
ru: ID сборки, который был протестирован, реимпорт может обновить это поле.

source: Commit hash tested, a reimport may update this field.
ru: Хэш протестированного коммита, реимпорт может изменить это поле.

source: Tag or branch that was tested, a reimport may update this field.
ru: Проверенный тег или ветка, реимпорт может изменить это поле.

source: API Scan Configuration
ru: Настройка сканирования API

source: Title
ru: Название

source: A short description of the flaw.
ru: Краткое описание недостатка.

source: Date
ru: Дата

source: The date the flaw was discovered.
ru: Дата обнаружения недостатка.

source: SLA Start Date
ru: Дата начала SLA

source: (readonly)The date used as start date for SLA calculation. Set by expiring risk acceptances. Empty by default, causing a fallback to 'date'.
ru: (только для чтения) Дата, используемая в качестве даты начала для расчёта SLA. Устанавливается для принятия рисков. По умолчанию она пуста и возвращается к 'дате'.

source: The CWE number associated with this flaw.
ru: Номер CWE, связанный с этим недостатком.

source: Vulnerability Id
ru: Идентификатор уязвимости

source: An id of a vulnerability in a security advisory associated with this finding. Can be a Common Vulnerabilities and Exposures (CVE) or from other sources.
ru: Идентификатор уязвимости в советах по безопасности, ассоциированный с этой находкой. Может быть Common Vulnerabilities and Exposures (CVE) или из других источников.

source: Common Vulnerability Scoring System version 3 (CVSSv3) score associated with this flaw.
ru: CVSSv3, связанный с этим недостатком.

source: CVSSv3 score
ru: Оценка CVSSv3

source: Numerical CVSSv3 score for the vulnerability. If the vector is given, the score is updated while saving the finding
ru: Числовой показатель CVSSv3 для уязвимости. Если задан вектор, оценка обновляется при сохранении находки

source: URL
ru: Адрес URL

source: External reference that provides more information about this flaw.
ru: Внешняя ссылка, содержащая более подробную информацию об этом недостатке.

source: Severity
ru: Серьезность

source: The severity level of this flaw (Critical, High, Medium, Low, Informational).
ru: Уровень тяжести этой дефекта (критический, высокий, средний, низкий, информативный).

source: Description
ru: Описание

source: Longer more descriptive information about the flaw.
ru: Более подробная информация о недостатке.

source: Mitigation
ru: Исправление

source: Text describing how to best fix the flaw.
ru: Текст, описывающий способ наилучшего исправления недостатка.

source: Text describing the impact this flaw has on systems, products, enterprise, etc.
ru: Текст, описывающий влияние этой ошибки на системы, продукты, предприятия и т.д.

source: Steps to Reproduce
ru: Шаги для воспроизведения

source: Text describing the steps that must be followed in order to reproduce the flaw / bug.
ru: Текст описания шагов, которые должны выполняться для воспроизведения дефекта/ошибки.

source: Severity Justification
ru: Обоснование важности

source: Text describing why a certain severity was associated with this flaw.
ru: Текст с описанием того, почему определенная степень тяжести связана с этим недостатком.

source: Endpoints
ru: Конечные точки

source: The hosts within the product that are susceptible to this flaw. + The status of the endpoint associated with this flaw (Vulnerable, Mitigated, ...).
ru: Принимающие стороны продукта, которые подвержены этому недостатку. + Статус конечной точки, связанной с этим недостатком (Уязвима, Решена, ...).

source: References
ru: Ссылки

source: The external documentation available for this flaw.
ru: Внешняя документация доступна для этого недостатка.

source: Test
ru: Проверка

source: The test that is associated with this flaw.
ru: Тест, связанный с этим недостатком.

source: Active
ru: Активно

source: Denotes if this flaw is active or not.
ru: Обозначает если этот недостаток активен или нет.

source: Denotes if this flaw has been manually verified by the tester.
ru: Определяет, если этот недостаток был подтвержден тестером вручную.

source: Denotes if this flaw has been deemed a false positive by the tester.
ru: Обозначает если этот недостаток был признан тестером False positive.

source: Duplicate
ru: Дубликат

source: Denotes if this flaw is a duplicate of other flaws reported.
ru: Сообщает, что если этот недостаток дублирует другие недостатки.

source: Duplicate Finding
ru: Дублированные уязвимости

source: Link to the original finding if this finding is a duplicate.
ru: Ссылка на оригинальную уязвимость, если эта является дубликатом.

source: Denotes if this flaw falls outside the scope of the test and/or engagement.
ru: Оповещает, если недостаток выходит за рамки теста и/или проверки.

source: Denotes if this finding has been marked as an accepted risk.
ru: Определяет, что находка была помечена как принятый риск.

source: Denotes is this flaw is currently being reviewed.
ru: Определяет, что недостаток находится на рассмотрении.

source: Last Status Update
ru: Последнее обновление статуса

source: Timestamp of latest status update (change in status related fields).
ru: Отметка времени последнего обновления статуса (изменение полей статуса).

source: Review Requested By
ru: Проверка запрошена

source: Documents who requested a review for this finding.
ru: Документы, запросившие проверку для этой находки.

source: Reviewers
ru: Рецензенты

source: Documents who reviewed the flaw.
ru: Документы, в которых рассматривается о недостатке.

source: Under Defect Review
ru: На рассмотрении

source: Denotes if this finding is under defect review.
ru: Обозначает если эта находка находится на рассмотрении.

source: Defect Review Requested By
ru: Проверка дефектов запрошена

source: Documents who requested a defect review for this flaw.
ru: Документы, запросившие проверку дефектов для этого недостатка.

source: Is Mitigated
ru: Исправлено

source: Denotes if this flaw has been fixed.
ru: Определяет, что этот недостаток был исправлен.

source: Denotes if this flaw has been fixed by storing the date it was fixed.
ru: Определяет, был ли этот недостаток исправлен, сохраняя дату исправления этой проблемы.

source: Documents who has marked this flaw as fixed.
ru: Документы, которые отметили этот недостаток как исправленный.

source: Reporter
ru: Сообщил

source: Documents who reported the flaw.
ru: Документы, которые сообщили о недостатке.

source: Notes
ru: Заметки

source: Stores information pertinent to the flaw or the mitigation.
ru: Сохраняет информацию, относящуюся к недостатку или смягчению последствий.

source: Numerical Severity
ru: Числовые оценки Severity

source: The numerical representation of the severity (S0, S1, S2, S3, S4).
ru: Числовое представление severity (S0, S1, S2, S3, S4).

source: Last Reviewed
ru: Последняя проверка

source: Provides the date the flaw was last 'touched' by a tester.
ru: Определяет дату, когда недостаток был последний раз "тронут" тестером.

source: Last Reviewed By
ru: Последняя проверка

source: Provides the person who last reviewed the flaw.
ru: Кто последний раз производил проверку недостатка.

source: Files
ru: Файлы

source: Files(s) related to the flaw.
ru: Файлы(ы), связанные с недостатком.

source: Parameter
ru: Параметр

source: Parameter used to trigger the issue (DAST).
ru: Параметр для срабатывания проблемы (DAST).

source: Payload used to attack the service / application and trigger the bug / problem.
ru: Payload, используемый для атаки на сервис/приложение и вызывающий ошибку/проблему.

source: Hash Code
ru: Хэш код

source: A hash over a configurable set of fields that is used for findings deduplication.
ru: Хэш значений настраиваемых полей, используемых для дедупликации находок.

source: Line number
ru: Номер строки

source: Source line number of the attack vector.
ru: Номер исходной строки вектора атаки.

source: File path
ru: Путь к файлу

source: Identified file(s) containing the flaw.
ru: Идентификационный файл(ы), содержащий недостаток.

source: Component name
ru: Название компонента

source: Name of the affected component (library name, part of a system, ...).
ru: Название затрагиваемого компонента (название библиотеки, часть системы, ...).

source: Component version
ru: Версия компонента

source: Version of the affected component.
ru: Версия затрагиваемого компонента.

source: Found by
ru: Найден

source: The name of the scanner that identified the flaw.
ru: Название сканера, который идентифицировал недостаток.

source: Static finding (SAST)
ru: Статический анализ (SAST)

source: Flaw has been detected from a Static Application Security Testing tool (SAST).
ru: Недостаток обнаружен Статическим Анализатором Кода (SAST).

source: Dynamic finding (DAST)
ru: Динамический анализ (DAST)

source: Flaw has been detected from a Dynamic Application Security Testing tool (DAST).
ru: Недостаток был обнаружен Динамическим Анализатором Кода (DAST).

source: Created
ru: Создано

source: The date the finding was created inside DefectDojo.
ru: Дата находки была создана внутри DefectDojo.

source: Scanner confidence
ru: Точность сканирования

source: Confidence level of vulnerability which is supplied by the scanner.
ru: Уровень критичности уязвимости был установлен сканером.

source: The SonarQube issue associated with this finding.
ru: Задача SonarQube была ассоциирована с этой находкой.

source: SonarQube issue
ru: Задачи SonarQube

source: Unique ID from tool
ru: Уникальный идентификатор инструмента

source: Vulnerability technical id from the source tool. Allows to track unique vulnerabilities.
ru: Технический идентификатор уязвимости инструмента. Применяется для отслеживания уникальных уязвимостей.

source: Vulnerability ID from tool
ru: Идентификатор уязвимости инструмента

source: Non-unique technical id from the source tool associated with the vulnerability type.
ru: Не уникальные технические идентификаторы инструмента ассоциированные с типом уязвимости.

source: SAST Source Object
ru: Исходный объект SAST

source: Source object (variable, function...) of the attack vector.
ru: Исходный объект (переменная, функция...) вектора атаки.

source: SAST Sink Object
ru: Стоковый объект SAST

source: Sink object (variable, function...) of the attack vector.
ru: Стоковый объект (переменная, функция...) вектора атаки.

source: SAST Source Line number
ru: Номер строки исходника переданного в SAST

source: SAST Source File Path
ru: Путь к исходному файлу SAST

source: Source file path of the attack vector.
ru: Путь к исходному файлу в векторе атаки.

source: Number of occurences
ru: Количество вхождений

source: Number of occurences in the source tool when several vulnerabilites were found and aggregated by the scanner.
ru: Количество вхождений в исходный код при обнаружении и агрегировании нескольких уязвимостей сканером.

source: Publish date
ru: Дата публикации

source: Date when this vulnerability was made publicly available.
ru: Дата, когда эта уязвимость стала общедоступна.

source: Service
ru: Сервис

source: A service is a self-contained piece of functionality within a Product. This is an optional field which is used in deduplication of findings when set.
ru: Самодостаточный функционал в рамках Продукта. Это опциональное поле, которое используется для дедупликации находок, если указано.

source: Planned Remediation Date
ru: Плановая дата пересмотра

source: The date the flaw is expected to be remediated.
ru: Ожидаемая дата, когда недостаток будет устранен.

source: The target version when the vulnerability should be fixed / remediated
ru: Целевая версия, когда уязвимость должна быть исправлена

source: Effort for fixing
ru: Сложность исправления

source: Effort for fixing / remediating the vulnerability (Low, Medium, High)
ru: Сложность исправления уязвимости (Низкий, Средний, Высокий)

source: Add tags that help describe this finding. Choose from the list or add new tags. Press Enter key to add.
ru: Добавьте теги, которые помогут описать эту находку. Выберите из списка или добавьте новые теги. Нажмите клавишу Enter для добавления.

source: Template Match Enabled
ru: Совпадение шаблона включено

source: Enables this template for matching remediation advice. Match will be applied to all active, verified findings by CWE.
ru: Включает этот шаблон для сопоставления рекомендаций по исправлению. Сопоставление будет применено ко всем активным и подтвержденным находкам по CWE.

source: Match Template by Title and CWE
ru: Сопоставление шаблона по заголовку и CWE

source: Matches by title text (contains search) and CWE.
ru: Сопоставление по тексту заголовка (содержит строку поиска) и CWE.

source: Add tags that help describe this finding template. Choose from the list or add new tags. Press Enter key to add.
ru: Добавьте теги, которые помогут описать этот шаблон находки. Выберите из списка или добавьте новые теги. Нажмите клавишу Enter для добавления.

source: Descriptive name which in the future may also be used to group risk acceptances together across engagements and products
ru: Описательное название, которое, возможно, будет использоваться в будущем для объединения в группы принятых рисков во всех проверках и продуктах

source: Recommendation from the security team.
ru: Рекомендация от команды безопасности.

source: Security Recommendation
ru: Рекомендации по безопасности

source: Explanation of security recommendation
ru: Пояснение рекомендаций по обеспечению безопасности

source: Security Recommendation Details
ru: Детали рекомендаций по безопасности

source: Risk treatment decision by risk owner
ru: Решение владельца риска об обращении с риском

source: If a compensating control exists to mitigate the finding or reduce risk, then list the compensating control(s).
ru: Если компенсирующие меры доступны для разрешения находки или снижения риска, то перечислите компенсирующие меры.

source: Accepted By
ru: Принят

source: The person that accepts the risk, can be outside of DefectDojo.
ru: Лицо, принимающее риск, может быть вне DefectDojo.

source: Proof
ru: Доказательство

source: User in DefectDojo owning this acceptance. Only the owner and staff users can edit the risk acceptance.
ru: Пользователь DefectDojo принявший риск. В дальнейшем только этот пользователь и администраторы могут редактировать эту информацию.

source: When the risk acceptance expires, the findings will be reactivated (unless disabled below).
ru: По истечении срока принятия риска находка будет вновь активирована (если не отключено ниже).

source: (readonly) Date at which notice about the risk acceptance expiration was sent.
ru: (только для чтения) Дата отправки оповещения об истечении срока принятия риска.

source: (readonly) When the risk acceptance expiration was handled (manually or by the daily job).
ru: (только для чтения) Когда было обработано истечение срока принятия риска (вручную или ежедневной задачей).

source: Reactivate findings on expiration
ru: Активировать находку по истечении срока принятия риска

source: Reactivate findings when risk acceptance expires?
ru: Активировать находку по истечении срока принятия риска?

source: Restart SLA on expiration
ru: Перезапустить SLA по истечении срока принятия риска

source: When enabled, the SLA for findings is restarted when the risk acceptance expires.
ru: Если включено, SLA для находки перезапустится по истечении срока принятия риска.

source: This dismissable message will be displayed on all pages for authenticated users. It can contain basic html tags, for example <a href='https://www.fred.com' style='color: #337ab7;' target='_blank'>https://example.com</a>
ru: Это скрываемое сообщение будет отображено на всех страницах для авторизованных пользователей. Оно может содержать базовые html теги, к примеру <a href='https://www.fred.com' style='color: #337ab7;' target='_blank'>https://example.com</a>

source: The style of banner to display. (info, success, warning, danger)
ru: Отображаемый стиль баннера. (синий, зеленый, желтый, красный)

source: This message will be displayed on the login page. It can contain basic html tags, for example <a href='https://www.fred.com' style='color: #337ab7;' target='_blank'>https://example.com</a>
ru: Это сообщение будет отображено на странице входа. Оно может содержать базовые html теги, к примеру <a href='https://www.fred.com' style='color: #337ab7;' target='_blank'>https://example.com</a>

source: Enter a name to give to this configuration
ru: Введите имя для этой конфигурации

source: Enter your Github API Key
ru: Введите ваш GitHub API ключ

source: GitHub issue URL
ru: URL проблемы на GitHub

source: Github project
ru: Проект на GitHub

source: Specify your project location. (:user/:repo)
ru: Укажите местоположение проекта. (:user/:repo)

source: Github Configuration
ru: Конфигурация Github

source: Notes added to findings will be automatically added to the corresponding github issue
ru: Примечания, добавленные в результаты будут автоматически добавлены в соответствующую задачу github

source: For more information how to configure Jira, read the DefectDojo documentation.
ru: Для получения дополнительной информации о том, как настроить связку с Jira, обратитесь к документации DefectDojo.

source: You can define extra issue types in settings.py
ru: Вы можете определить дополнительные типы задач в settings.py

source: Choose the folder containing the Django templates used to render the JIRA issue description. These are stored in dojo/templates/issue-trackers. Leave empty to use the default jira_full templates.
ru: Выберите папку, содержащую шаблоны Django, используемые для отображения описания задач в JIRA. Они хранятся в dojo/templates/issue-trackers. Оставьте пустым, чтобы использовать шаблоны по умолчанию.

source: To obtain the 'Epic name id' visit https://<YOUR JIRA URL>/rest/api/2/field and search for Epic Name. Copy the number out of cf[number] and paste it here.
ru: Чтобы получить 'Идентификатор эпика', посетите https://<URL вашей JIRA>/rest/api/2/field и выполните поиск по имени эпика. Скопируйте номер из cf[число] и вставьте его здесь.

source: Reopen Transition ID
ru: Идентификатор для повторного открытия задачи
