Repository: VYACHESLAV204/newDjangoDefect
Catalog: dojo/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Weekly activity, displayed by day, of findings you reported.
ru: Еженедельная активность с разбивкой по дням о сообщенных вами находках.

source: Weeks are only displayed if findings are available.
ru: Недели отображаются только при наличии находок.

source: Delete All alerts %(product)s
ru: Удалить все оповещения %(product)s

source: Delete all alerts will remove all alerts from this instance
ru: Удаление всех оповещений удалит все оповещения из этого экземпляра

source: Danger Zone
ru: Опасная зона

source: The following alerts will be deleted
ru: Следующие оповещения будут удалены

source: Delete Alert
ru: Удалить оповещение

source: Delete Benchmarks for %(product)s
ru: Удалить бенчмарки %(product)s

source: Deleting these benchmarks will remove the benchmarks from the product and any related notes on the benchmarks.
ru: Удаление этих бенчмарков удалит бенчмарки из продукта и все связанные с ними заметки.

source: Delete Product Type %(product_type)s
ru: Удалить тип продукта %(product_type)s

source: Deleting this Product Type will remove any related objects associated with it. These relationships are listed below:
ru: Удаление этого типа продукта приведет к удалению всех связанных с ним объектов. Эти связи перечислены ниже:

source: No relationships found.
ru: Связи не найдены.

source: Delete User %(to_delete)s
ru: Удалить пользователя %(to_delete)s

source: Deleting this User will remove any related objects associated with it. These relationships are listed below:
ru: Удаление этого пользователя приведет к удалению всех связанных с ним объектов. Эти связи перечислены ниже:

source: Delete User
ru: Удалить пользователя

source: Dismiss Announcement
ru: Скрыть объявление

source: Dismissing the announcement will remove the current announcement from your view
ru: Скрыв объявление, вы больше его не увидите

source: Edit Note
ru: Редактировать заметку

source: Save
ru: Сохранить

source: Edit Product Type %(name)s
ru: Изменить тип продукта %(name)s

source: Edit product type
ru: Изменить тип продукта

source: Edit Tool Type Configuration
ru: Изменить конфигурацию типа инструмента

source: %(filter_name)s Findings
ru: Находка %(filter_name)s

source: Report
ru: Отчет

source: CSV Export
ru: Экспорт в CSV

source: Excel Export
ru: Экспорт в Excel

source: Bulk Edit
ru: Массовое изменение

source: Choose wisely...
ru: Выбирайте мудро...

source: Choose...
ru: Выберете...

source: Info
ru: Инфо

source: Critical
ru: Критический

source: Out of scope
ru: Вне скоупа

source: Risk Acceptance
ru: Риск принят

source: Accept
ru: Принять

source: Unaccept
ru: Отменить принятие

source: Group
ru: Группа

source: Remove from any group
ru: Удалить из всех групп

source: Push to Jira
ru: Отправить в Jira

source: Push to GitHub
ru: Отправить в GitHub

source: Tags
ru: Теги

source: All
ru: Все

source: Age
ru: Возраст

source: Found By
ru: Найден

source: JIRA Age
ru: Возраст JIRA

source: JIRA Change
ru: Изменение JIRA

source: Planned Remediation
ru: Запланированное исправление

source: View
ru: Просмотр

source: Copy
ru: Копировать

source: Clear Review
ru: Очистить проверку

source: Request Peer Review
ru: Запрос коллегиальной проверки

source: Touch Finding
ru: Находка просмотрена

source: Make Finding a Template
ru: Создать шаблон из находки

source: Apply Template to Finding
ru: Применить шаблон к находке

source: Close Finding
ru: Закрыть находку

source: Open Finding
ru: Открыть находку

source: Unaccept Risk
ru: Отозвать принятие риска

source: Accept Risk
ru: Принять риск

source: Add Risk Acceptance...
ru: Добавить принятие риска...

source: No findings found.
ru: Находки не найдены.

source: Retrieve Username
ru: Получить имя пользователя

source: Forgotten your username? Enter your email address below, and we’ll email it to you.
ru: Забыли имя пользователя? Введите свой адрес электронной почты ниже, и мы отправим его по электронной почте.

source: Retreive my username
ru: Получить мое имя пользователя

source: We’ve emailed you information about your user account, if an account exists with the email you entered. You should receive the requested information shortly.
ru: Если пользователь с введенной электронной почтой существует, то вам на почту придет письмо с информацией о вашей учетной записи. Вы должны получить запрошенную информацию в ближайшее время.

source: If you don’t receive an email, please make sure you’ve entered the address you registered with, and check your spam folder.
ru: Если вы не получили инструкцию, убедитесь, что вы ввели тот адрес электронный почты, на который зарегистрирована учетная запись и проверьте папку со спамом.

source: Retrieve username on %(site_name)s
ru: Получить имя пользователя на %(site_name)s

source: Login
ru: Войти

source: Show Password
ru: Показать пароль

source: I forgot my password
ru: Забыл пароль

source: I forgot my username
ru: Забыл имя пользователя

source: Login with Google
ru: Войти через Google

source: Login with OKTA
ru: Войти через OKTA

source: Login with Azure AD
ru: Войти через Azure AD

source: Login with Gitlab
ru: Войти через Gitlab

source: Login with Auth0
ru: Войти с помощью Auth0

source: Login with Github Enterprise
ru: Войти через Github Enterprise

source: %(name)s is affected by <b>both</b> critical and high severity vulnerabilities.
ru: На %(name)s влияют уязвимости и <b>критического</b> и <b>высокого</b> уровня критичности.

source: Critical Severity Vulnerabilities
ru: Критические уязвимости

source: High Severity Vulnerabilities
ru: Уязвимости высокой критичности

source: %(name)s is affected by critical vulnerabilities.
ru: %(name)s подвержен критическим уязвимостям.

source: %(name)s is affected by high severity vulnerabilities.
ru: %(name)s подвержен уязвимостям высокой критичности.

source: Full Metrics
ru: Полные метрики

source: No Critical Products registered
ru: Не зарегистрировано критических продуктов

source: Active Bug Count by Month
ru: Количество активных ошибок по месяцам

source: Metric Counts
ru: Количественные метрики

source: Top 10 Products <br/> by bug severity
ru: Топ 10 продуктов <br/> по критичности ошибок

source: Detail Breakdown
ru: Детальный разбор

source: Opened Findings
ru: Открытые находки

source: Accepted Findings
ru: Уязвимости с принятым риском

source: Trending Open<br/>Bug Count
ru: Тренд <br/> появления ошибок

source: Trending Accepted <br/> Bug Count
ru: Тренд <br/> принятия риска

source: Age of Issues
ru: Возраст задач

source: Total
ru: Всего

source: Opened During Period
ru: Открыто за период

source: Accepted in Period
ru: Принято за период

source: Closed in Period
ru: Закрыто за период

source: Weekly
ru: Неделя

source: Closed*
ru: Закрыто*

source: Monthly
ru: Месяц

source: *Closed findings may have been opened outside of requested period.
ru: *Закрытые находки могут быть открыты вне запрошенного периода.

source: By Week
ru: По неделям

source: By Month
ru: По месяцам

source: Days
ru: Дни

source: Bug Count
ru: Количество ошибок

source: 0 - 30 Days
ru: 0 - 30 дней

source: 31 - 60 Days
ru: 31 - 60 дней

source: 61 - 90 Days
ru: 61 - 90 дней

source: 91+ Days
ru: 91+ дней

source: Add Some Group Members
ru: Добавить участников группы

source: Register new Product Members
ru: Зарегистрировать новых участников продукта

source: Register a new Product Type
ru: Зарегистрировать новый тип продукта

source: Register new Product Type Members
ru: Зарегистрировать новых участников типа продукта

source: Add a Tool Type Configuration
ru: Добавить конфигурацию типа инструмента

source: System
ru: Система

source: Personal
ru: Личное

source: Notification Settings
ru: Параметры уведомлений

source: Scope
ru: Скоуп

source: Destinations for system notifications are configured in System Settings. Destinations for personal notifications are taken from your personal contact details (personal Slack notifications will be sent to you as a direct message).
ru: Адресаты для системных уведомлений настроены в системных настройках. Адресаты для личных уведомлений берутся из личных контактных данных (личные уведомления Slack будут отправляться вам в качестве прямого сообщения).

source: Template
ru: Шаблон

source: These notification settings apply <u>globally</u> to all products and will be sent to all superusers.
ru: Эти настройки уведомлений применяются <u>глобально</u> ко всем продуктам и будут отправлены всем суперпользователям.

source: These notification settings apply <u>globally</u> to all products that you have read access to and will be sent to you only.
ru: Эти настройки уведомлений применяются <u>глобально</u> ко всем продуктам, к которым вы имеете доступ на чтение, и будут отправлены только вам.

source: If you want only notifications for certain products you should disable everything here and enable notifications on those products.
ru: Если вы хотите получать уведомления только для определенных продуктов, вы должны отключить все настройки тут и включить уведомления на уровне продуктов.

source: These template <u>template</u>
ru: Это шаблон <u>шаблона</u>

source: Event
ru: Событие

source: Mail
ru: Почта

source: Alert
ru: Предупреждение

source: Showing entries %(start_index)s to %(end_index)s of %(count)s
ru: Показ записей с %(start_index)s до %(end_index)s из %(count)s

source: Page Size
ru: Размер страницы

source: Toggle Dropdown
ru: Вкл/Выкл выпадающий список

source: Password reset
ru: Сброс пароля

source: Forgotten your password? Enter your email address below, and we’ll email instructions for setting a new one.
ru: Забыли пароль? Введите свой адрес электронной почты ниже, и мы отправим инструкции по установке нового.

source: Reset my password
ru: Восстановить мой пароль

source: Your password has been set. You may go ahead and log in now.
ru: Ваш пароль был установлен. Вы можете продолжить и войти прямо сейчас.

source: Log in
ru: Войти

source: Password reset confirmation
ru: Подтверждение изменения пароля

source: Please enter your new password twice so we can verify you typed it in correctly.
ru: Пожалуйста, введите ваш новый пароль дважды, чтобы мы могли убедиться, что вы ввели его правильно.

source: Change my password
ru: Изменить мой пароль

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
ru: Ссылка для изменения пароля была неверна, возможно, потому что она уже была использована. Пожалуйста, запросите новое изменение пароля.

source: We’ve emailed you instructions for setting your password, if an account exists with the email you entered. You should receive them shortly.
ru: Мы выслали вам инструкцию для настройки пароля. Если учетная запись с указанным вами адресом электронной почты существует, вскоре вы получите инструкцию.

source: Product count
ru: Количество продуктов

source: Active (Verified) findings
ru: Активные (Подтвержденные) находки

source: Critical product
ru: Критический продукт

source: Key product
ru: Ключевой продукт

source: Product Type Report
ru: Отчет по типу продукта

source: No product types found.
ru: Типы продукта не найдены.

source: User Profile - %(full_name)s
ru: Профиль пользователя - %(full_name)s

source: Last Login:
ru: Последний вход:

source: Date Joined:
ru: Зарегистрирован:

source: Add Groups
ru: Добавить группы

source: No group members found.
ru: Участники группы не найдены.

source: Generate Metrics For Selected Period
ru: Сгенерировать метрики по выбранному периоду

source: Finding Information For Period of
ru: Информация о находках для периода

source: Metrics by Product Types
ru: Метрики типов продукта

source: Metrics by Products
ru: Метрики продуктов

source: Trending Total Bug Count By Month
ru: Тренд ошибок безопасности по месяцам

source: Month
ru: Месяц

source: Opened in Month
ru: Открыто за месяц

source: Total Closed
ru: Всего закрыто

source: Active to Date
ru: Активно к дате

source: Total Active and Verified To Date
ru: Активно и подтверждено к дате

source: Total Security Bug Count In Period
ru: Всего ошибок безопасности за период

source: Opened
ru: Открыто

source: Trend
ru: Тренд

source: Top By Bug Severity
ru: Лидеры по критичности ошибок

source: Generate Metrics For Selected Month/Year
ru: Сгенерировать метрики по выбранному месяцу/году

source: View Details
ru: Подробности

source: Opened This Month
ru: Открыто в этом месяце

source: Closed This Month
ru: Закрыто в этом месяце

source: This simple search function will return results whose findings or finding templates title, URL, description, endpoints, tags, references, languages or technologies contain the search query and products whose name, tags or description contain the search query.</br> Advanced search operators: (Restrict results to a certain type) product:, engagement:, finding:, endpoint:, tag:, language:, technology: or vulnerability_id:. test-tags shows findings in tests that are tagged with provided tag, similar for engagement-tags and product-tags. After submitting the search query, tabbed results will be displayed. The findings tab will have the possibility to to perform more finegrained filtering on status fields, test type, etc.
ru: Эта простая функия поиска покажет находки и шаблоны находок, чьи заголовки, URL, описания, конечные точки, теги, ссылки, языки или технологии содержат поисковой запрос, а также продукты, чьи названия, теги или описания содержат поисковой запрос.</br> Дополнительные параметры поиска: (Ограничить результаты для определенных типов) продукт:, проверка:, находка:, конечная точка:, тег:, язык:, технология: или идентификатор уязвимости:. Теги теста показывают находки в тестах, которые отмеченны указанным тегом, Аналогично для тегов проверок и продуктов. После отправки поискового запроса, результаты будут показаны во вкладках. Вкладка находок позволит выполнить более тонкую фильтрацию по статусным полям, типу теста и т. д.

source: Vulnerability Ids
ru: Идентификаторы уязвимости

source: Tests
ru: Тесты

source: Languages
ru: Языки

source: Application Technolgies
ru: Технологии приложения

source: Finding
ru: Находка

source: Endpoint
ru: Конечная точка

source: Endpoint is broken. Check documentation to look for fix process
ru: Конечная точка повреждена. Проверьте документацию, чтобы найти процесс для исправления

source: No Open, Active Findings
ru: Не открывать, активные находки

source: Language
ru: Язык

source: Technology
ru: Технология

source: Item
ru: Элемент

source: Finding Template
ru: Шаблон находки

source: Rank
ru: Рейтинг

source: Tool Types
ru: Типы инструмента

source: Add Tool Type
ru: Добавить тип инструмента

source: No tool types found
ru: Типы инструмента не найдены

source: First Name
ru: Имя

source: Last Name
ru: Фамилия

source: User Name
ru: Имя пользователя

source: Superuser
ru: Суперпользователь

source: New User
ru: Новый пользователь

source: Phone Number(s)
ru: Номер(а) телефона

source: Last Login
ru: Последний вход

source: Phone:
ru: Телефон:

source: Cell:
ru: Ячейка:

source: Never
ru: Никогда

source: No Users
ru: Нет пользователей

source: Planned Remediation version
ru: Запланированная версия исправления

source: Import History
ru: История импортов

source: Action
ru: Действие

source: Date/Time
ru: Дата/время

source: Import Type
ru: Тип импорта

source: Commit
ru: Коммит

source: Version
ru: Версия

source: No import history found.
ru: История импортов не найдена.

source: Note History
ru: История заметок

source: commented %(time)s
ru: прокомментировано в %(time)s

source: made changes on %(time)s
ru: изменено в %(time)s

source: Note type:
ru: Тип заметки:

source: Return
ru: Вернуться

source: Product Report
ru: Отчет по продукту

source: CRITICAL
ru: КРИТИЧЕСКИЙ

source: HIGH
ru: ВЫСОКИЙ

source: MEDIUM
ru: СРЕДНИЙ

source: LOW
ru: НИЗКИЙ

source: INFORMATIONAL
ru: ИНФОРМАЦИОННЫЙ

source: TOTAL
ru: ВСЕГО

source: Technologies
ru: Технологии

source: Add new Technology
ru: Добавить новую технологию

source: There are no technologies.
ru: Нет технологий.

source: There are no regulations.
ru: Никаких правил нет.

source: Benchmark Progress
ru: Прогресс бенчмарка

source: complete
ru: прогресс

source: Successful
ru: Успешно

source: Pending
ru: В обработке

source: Identified
ru: Определено

source: There are no benchmarks
ru: Нет бенчмарков

source: Members
ru: Участники

source: Add Users
ru: Добавить пользователей

source: User
ru: Пользователь

source: Role
ru: Роль

source: Product member
ru: Участник продукта

source: No members found.
ru: Участников не обнаружено.

source: Product Group
ru: Группа продуктов

source: No groups found.
ru: Группы не найдены.

source: JIRA tasks
ru: Задачи JIRA

source: Metadata
ru: Метаданные

source: Business Criticality
ru: Критичность для бизнеса

source: Product Type
ru: Тип продукта

source: Platform
ru: Платформа

source: Lifecycle
ru: Жизненный цикл

source: Origin
ru: Источник

source: User Records
ru: Пользовательских данных

source: Revenue
ru: Доход

source: files
ru: файлов

source: and
ru: и

source: lines of code
ru: строк в коде

source: Custom Fields
ru: Пользовательские поля

source: Contacts
ru: Контакты

source: Team Manager
ru: Руководитель

source: Product Manager
ru: Менеджер по продукту

source: Technical Contact
ru: Технические вопросы

source: These are your personal settings for this product.
ru: Это ваши персональные настройки для этого продукта.

source: saving...
ru: сохранение...

source: Criticality
ru: Критичность

source: Active (Verified) Findings
ru: Активные (Подтвержденные) находки

source: No products found.
ru: Продукты не найдены.

source: Add Product Type Group
ru: Добавить группу типа продукта

source: Updated
ru: Обновлено

source: Edit Test
ru: Редактировать тест

source: Copy Test
ru: Копировать тест

source: Re-Upload Scan
ru: Повторно загрузить отчет

source: Add Notes
ru: Добавить заметки

source: Add To Calendar
ru: Добавить в календарь

source: Delete Test
ru: Удалить тест

source: Environment
ru: Окружение

source: Dates
ru: Даты

source: Progress
ru: Прогресс

source: Reimports
ru: Реимпорты

source: Details
ru: Подробности

source: Creator
ru: Автор

source: Jira Age
ru: Возраст Jira

source: Jira Change
ru: Изменено в Jira

source: View/Edit
ru: Просмотр/редактирование

source: No Groups found.
ru: Группы не найдены.

source: New Finding
ru: Новая находка

source: Finding From Template
ru: Находка из шаблона

source: Create
ru: Создать

source: Add to...
ru: Добавить в...

source: Group by
ru: Группировать по

source: Push to JIRA
ru: Отправить в Jira

source: Potential Findings
ru: Потенциальные находки

source: Add Potential Finding
ru: Добавить потенциальную находку

source: Promote To Finding
ru: Продвинуть до находки

source: Credentials
ru: Учётные данные

source: Username
ru: Имя пользователя

source: Login Valid
ru: Учетная запись действительна

source: Credentials Configured for this
ru: Учетные данные настроены для этого

source: None configured
ru: Не настроено

source: No credentials configured.
ru: Учётные данные не настроены.

source: Configure engagement credentials first, then add credentials to the test.
ru: Сначала настройте учетные данные проверки, потом добавьте учетные данные к тесту.

source: ProTip!
ru: Совет профессионала новичку!

source: to edit this test. Type
ru: для изменения этого теста. Нажмите

source: to add a finding to this test.
ru: чтобы добавить находку к этому тесту.

source: User %(full_name)s
ru: Пользователь %(full_name)s

source: Contact Information
ru: Контактная информация

source: Phone Number
ru: Номер телефона

source: Cell Number
ru: Номер ячейки

source: Twitter Username
ru: Имя пользователя в Twitter

source: Github Username
ru: Имя пользователя в Github

source: Product Type Membership
ru: Членство в типах продукта

source: Add Product Types
ru: Добавить типы продукта

source: No product type members found.
ru: Участники типа продукта не найдены.

source: Product Membership
ru: Членство в продуктах

source: Add Products
ru: Добавить продукты

source: No product members found.
ru: Участники продукта не найдены.

source: Group Membership
ru: Членство в группах

source: Block execution
ru: Заблокирован

source: Configuration Permissions
ru: Настройки разрешений

source: Add
ru: Добавить

source: (saving...)
ru: (сохранение...)

source: Checklist is %(level)s full (pass: %(total_viewed)s, total: %(total)s)
ru: Завершено на %(level)s (успешно: %(total_viewed)s, всего: %(total)s)

source: Note added successfully.
ru: Заметка успешно добавлена.

source: Test saved.
ru: Тест сохранен.

source: Test and relationships will be removed in the background.
ru: Тест и его связи будут удалены в фоновом режиме.

source: Test and relationships removed.
ru: Тест и его связи удалены.

source: Deletion of %(title)s
ru: Удаление %(title)s

source: The test "%(title)s" was deleted by %(user)s
ru: Тест "%(title)s" был удален пользователем %(user)s

source: Test Calendar
ru: Календарь тестов

source: Test: %(test_type_name)s (%(product_name)s)
ru: Тест: %(test_type_name)s (%(product_name)s)

source: Set aside for test %(test_type_name)s, on product %(product_name)s. Additional detail can be found at %(detail_url)s
ru: Отложить тест %(test_type_name)s, продукта %(product_name)s. Дополнительную информацию можно найти на %(detail_url)s

source: Addition of %(title)s
ru: Добавление %(title)s

source: Finding "%(title)s" was added by %(user)s
ru: Находка "%(title)s" была добавлена пользователем %(user)s

source: Finding from template added successfully.
ru: Находка по шаблону успешно добавлена.

source: The form has errors, please correct them below.
ru: В форме допущены ошибки, пожалуйста, исправьте их ниже.

source: Add From Template
ru: Добавить из шаблона

source: When re-uploading a scan, any findings not found in original scan will be updated as mitigated. The process attempts to identify the differences, however manual verification is highly recommended.
ru: При повторной загрузке результатов сканирования любые находки, которые не были найдены при повторном сканировании, будут переведены в статус "Решено". Этот процесс пытается самостоятельно определить различия в находках, однако настоятельно рекомендуется проводить ручную проверку.

source: Report file is too large. Maximum supported size is %(size)d MB
ru: Файл отчета слишком большой. Максимальный поддерживаемый размер - %(size)d МБ

source: Re-upload a %(scan_type)s
ru: Повторная загрузка %(scan_type)s

source: Product Tool Configuration Successfully Created.
ru: Конфигурация инструмента продукта успешно создана.

source: Tool Configurations
ru: Конфигурации инструмента

source: Tool Product Configuration Successfully Updated.
ru: Конфигурация инструмента продукта успешно обновлена.

source: Edit Product Tool Configuration
ru: Изменить конфигурацию инструмента продукта

source: Tool Product Successfully Deleted.
ru: Инструмент продукта успешно удален.

source: Delete Product Tool Configuration
ru: Удалить конфигурацию инструмента продукта

source: Tool Type Configuration Successfully Created.
ru: Конфигурация типа инструмента успешно создана.

source: New Tool Type Configuration
ru: Новая конфигурация типа инструмента

source: Tool Type successfully updated.
ru: Тип инструмента успешно изменен.

source: Edit Tool Type
ru: Изменить тип инструмента

source: Tool Type List
ru: Список типов инструмента

source: Password must be at least {minimum_length} characters long.
ru: Пароль должен содержать не менее {minimum_length} символов.

source: Password must be less than {maximum_length} characters long.
ru: Пароль должен быть менее {maximum_length} символов.

source: Password must contain at least 1 digit, 0-9.
ru: Пароль должен содержать хотя бы одну цифру, 0-9.

source: Password must contain at least 1 uppercase letter, A-Z.
ru: Пароль должен содержать хотя бы одну заглавную букву, A-Z.
