Repository: VYACHESLAV204/newDjangoDefect
Catalog: dojo/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Transition ID to Re-Open JIRA issues, visit https://<YOUR JIRA URL>/rest/api/latest/issue/<ANY VALID ISSUE KEY>/transitions?expand=transitions.fields to find the ID for your JIRA instance
ru: Идентификатор перехода к повторному открытию задачи JIRA, посетите https://<YOUR JIRA URL>/rest/api/latest/issue/<ANY VALID ISSUE KEY>/transitions?expand=transitions.fields, чтобы найти идентификатор для вашего экземпляра JIRA

source: Close Transition ID
ru: Идентификатор перехода к закрытию

source: Transition ID to Close JIRA issues, visit https://<YOUR JIRA URL>/rest/api/latest/issue/<ANY VALID ISSUE KEY>/transitions?expand=transitions.fields to find the ID for your JIRA instance
ru: Идентификатор перехода к закрытию задачи JIRA, посетите https://<YOUR JIRA URL>/rest/api/latest/issue/<ANY VALID ISSUE KEY>/transitions?expand=transitions.fields, чтобы найти идентификатор для вашего экземпляра JIRA

source: Maps to the 'Priority' field in Jira. For example: Info
ru: Соответствует полю "Priority" в Jira. Например: Info

source: Maps to the 'Priority' field in Jira. For example: Low
ru: Соответствует полю "Priority" в Jira. Например: Low

source: Maps to the 'Priority' field in Jira. For example: Medium
ru: Соответствует полю "Priority" в Jira. Например: Medium

source: Maps to the 'Priority' field in Jira. For example: High
ru: Соответствует полю "Priority" в Jira. Например: High

source: Maps to the 'Priority' field in Jira. For example: Critical
ru: Соответствует полю "Priority" в Jira. Например: Critical

source: Additional text that will be added to the finding in Jira. For example including how the finding was created or who to contact for more information.
ru: Дополнительный текст, который будет добавлен в находку в Jira. Например, может включать в себя информацию о том, как находка была создана или к кому можно обратиться за дополнительной информацией.

source: JIRA resolution names (comma-separated values) that maps to an Accepted Finding
ru: Названия решений в JIRA (значения, разделенные запятыми), которые сопоставляются с принятым риском

source: JIRA resolution names (comma-separated values) that maps to a False Positive Finding
ru: Названия решений в JIRA (значения, разделенные запятыми), которые сопоставляются с False Positive находкой

source: Globally send SLA notifications as comment?
ru: Глобально отправлять SLA уведомления в качестве комментария?

source: This setting can be overidden at the Product level
ru: Этот параметр может быть изменен на уровне продукта

source: Automatically sync Findings with JIRA?
ru: Автоматически синхронизировать находки с JIRA?

source: If enabled, this will sync changes to a Finding automatically to JIRA
ru: Если включено, будет автоматически отправлять изменения находок в JIRA

source: JIRA Instance
ru: Экземпляр JIRA

source: JIRA custom field JSON mapping of Id to value, e.g. {"customfield_10122": [{"name": "8.0.1"}]}
ru: Пользовательское поле в JIRA, представляющее собой сопоставление идентификаторов и значений в формате JSON, например {"customfield_10122": [{"name": "8.0.1"}]}

source: JIRA default assignee (name). If left blank then it defaults to whatever is configured in JIRA.
ru: Исполнитель по умолчанию в JIRA (имя). Если оставлено пустым, то используется значение по умолчанию, настроенное в JIRA.

source: Automatically maintain parity with JIRA. Always create and update JIRA tickets for findings in this Product.
ru: Автоматически поддерживать паритет с JIRA. Всегда создавать и обновлять задачи JIRA для находок в этом Продукте.

source: Send SLA notifications as comment?
ru: Отправлять SLA уведомления в качестве комментария?

source: Send Risk Acceptance expiration notifications as comment?
ru: Отправлять оповещение об истечении срока принятия риска в качестве комментария?

source: Jira creation
ru: Дата создания задачи в Jira

source: The date a Jira issue was created from this finding.
ru: Дата создания задачи в Jira по этой находке.

source: Jira last update
ru: Дата последнего обновления в Jira

source: The date the linked Jira issue was last modified.
ru: Дата последнего изменения связанной задачи в Jira.

source: Triggered whenever an (re-)import has been done that created/updated/closed findings.
ru: Срабатывает каждый раз, когда (ре)импорт выполняется создавая/изменяя/закрывая находки.

source: JIRA problems
ru: Проблемы JIRA

source: JIRA sync happens in the background, errors will be shown as notifications/alerts so make sure to subscribe
ru: Синхронизация JIRA происходит в фоновом режиме, ошибки будут показаны как уведомления/оповещения, так что не забудьте подписаться

source: SLA breach
ru: Нарушение SLA

source: Get notified of (upcoming) SLA breaches
ru: Получать уведомления о (грядущих) нарушениях SLA

source: Risk Acceptance Expiration
ru: Принятие риска действует до

source: Get notified of (upcoming) Risk Acceptance expiries
ru: Получать уведомления о (грядущем) истечении срока приема риска

source: Succesfully
ru: Успешно

source: Login is valid
ru: Учетка активная

source: Credential
ru: Учётные данные

source: Authentication Provider
ru: Провайдер аутентификации

source: HTML color
ru: Цвет HTML

source: Number of files
ru: Количество файлов

source: Number of blank lines
ru: Количество пустых строк

source: Number of comment lines
ru: Количество строк комментариев

source: Number of code lines
ru: Количество строк кода

source: Confidence level
ru: Уровень доверия

source: Version Number
ru: Номер версии

source: Full file path
ru: Полный путь к файлу

source: Folder
ru: Папка

source: Artifact
ru: Артефакт

source: Add tags that help describe this object. Choose from the list or add new tags. Press Enter key to add.
ru: Добавьте теги, которые помогут описать этот объект. Выберите из списка или добавьте новые теги. Нажмите клавишу Enter для добавления.

source: Test Unique Identifier
ru: Тест уникального идентификатора

source: Name of the test
ru: Название теста

source: Summary of the test
ru: Описание теста

source: Objective of the test
ru: Цель теста

source: How to test the objective
ru: Как протестировать цель

source: What the results look like for a test
ru: Какие ожидаются результаты теста

source: Benchmark Type
ru: Тип бенчмарка

source: Pass
ru: Проверено

source: Does the product meet the requirement?
ru: Соответствует ли продукт требованию?

source: Applicable for this specific product.
ru: Применимо для этого конкретного продукта.

source: Total number of active benchmarks for this application.
ru: Общее количество активных бенчмарков для этого приложения.

source: ASVS Level 1 Score
ru: Оценка уровня 1 ASVS

source: ASVS Level 2 Score
ru: Оценка уровня 2 ASVS

source: ASVS Level 3 Score
ru: Оценка уровня 3 ASVS

source: Publish score to Product.
ru: Опубликовать балл в продукте.

source: The render order
ru: Порядок отображения

source: If selected, user doesn't have to answer this question
ru: Если выбрано, пользователь может не отвечать на этот вопрос

source: The question text
ru: Текст вопроса

source: Select one or more
ru: Выберите не менее одного

source: Engagement Survey
ru: Опрос о проверке

source: Answered Engagement Survey
ru: Опросы о проверке, у которые есть ответ

source: Answered Engagement Surveys
ru: Опросы о проверке, у которых есть ответ

source: General Engagement Survey
ru: Общий опрос по проверке

source: General Engagement Surveys
ru: Общие опросы по проверке

source: The answer text
ru: Текст ответа

source: The selected choices as the answer
ru: Выбранный вариант ответа

source: Note deleted.
ru: Примечание удалено.

source: Note was not succesfully deleted.
ru: Примечание не было удалено.

source: Note edited.
ru: Примечание отредактировано.

source: Note was not succesfully edited.
ru: Примечание не было изменено.

source: Product %(title)s has been created successfully.
ru: Продукт %(title)s успешно создан.

source: Product Type %(title)s has been created successfully.
ru: Тип продукта %(title)s успешно создан.

source: Event %(event)s has occurred.
ru: Произошло событие %(event)s.

source: System notification settings
ru: Системные настройки уведомлений

source: Settings saved.
ru: Настройки сохранены.

source: Personal notification settings
ru: Персональные настройки уведомлений

source: Template notification settings
ru: Шаблон настроек уведомлений

source: Product List
ru: Список продуктов

source: All Engagements
ru: Все проверки

source: Product added successfully.
ru: Продукт успешно добавлен.

source: GitHub information added successfully.
ru: Данные GitHub успешно добавлены.

source: This label is automatically applied to all issues created by DefectDojo
ru: Эта метка автоматически применяется ко всем задачам, созданным в DefectDojo

source: New Product
ru: Новый продукт

source: Product updated successfully.
ru: Продукт успешно обновлен.

source: GITHUB information updated successfully.
ru: Данные GITHUB успешно обновлены.

source: Edit Product
ru: Изменить продукт

source: Product and relationships will be removed in the background.
ru: Продукт и его связи будут удалены в фоновом режиме.

source: Product and relationships removed.
ru: Продукт и его связи удалены.

source: Deletion of %(name)s
ru: Удаление %(name)s

source: The product "%(name)s" was deleted by %(user)s
ru: Продукт "%(name)s" был удален пользователем %(user)s

source: Engagement added successfully.
ru: Проверка успешно добавлена.

source: New CI/CD Engagement
ru: Новая проверка CI/CD

source: New Interactive Engagement
ru: Новая интерактивная проверка

source: Technology added successfully.
ru: Технология успешно добавлена.

source: Add Technology
ru: Добавить технологию

source: Technology changed successfully.
ru: Технология успешно изменена.

source: Edit Technology
ru: Изменить технологию

source: Technology deleted successfully.
ru: Технология успешно удалена.

source: Delete Technology
ru: Удалить технологию

source: Metadata added successfully.
ru: Метаданные успешно добавлена.

source: Add Metadata
ru: Добавить метаданные

source: Metadata edited successfully.
ru: Метаданные успешно изменены.

source: Edit Metadata
ru: Изменить метаданные

source: Pen Test
ru: Пентест

source: Ad Hoc Engagement
ru: Для данной проверки

source: Add Finding
ru: Добавить уязвимость

source: Can not set a finding as inactive without adding all mandatory notes
ru: Невозможно пометить находку как не активную без добавления всех обязательных заметок

source: Can not set a finding as false positive without adding all mandatory notes
ru: Невозможно пометить находку как false positive без добавления всех обязательных заметок

source: Can not set a finding as inactive or false positive without adding all mandatory notes
ru: Невозможно пометить находку как не активную или false positive без добавления всех обязательных заметок

source: Finding added successfully.
ru: Находка успешно добавлена.

source: Engagement Presets
ru: Шаблоны проверки

source: Edit Engagement Preset
ru: Изменить шаблоны проверки

source: Engagement Preset Successfully Updated.
ru: Шаблон проверки обновлен.

source: Engagement Preset Successfully Created.
ru: Шаблон проверки создан.

source: New Engagement Preset
ru: Новый шаблон проверки

source: Engagement presets and engagement relationships removed.
ru: Удалены шаблоны и связи проверки.

source: Delete Engagement Preset
ru: Удалить шаблон проверки

source: Notification settings updated.
ru: Настройки уведомлений обновлены.

source: You are not permitted to add users as owners.
ru: У вас не хватает прав на добавление пользователей в качестве владельцев.

source: Product members added successfully.
ru: Участники продукта успешно добавлены.

source: Add Product Member
ru: Добавить участника продукта

source: You are not permitted to make users to owners.
ru: У вас не хватает прав на повышение пользователя до владельца.

source: Product member updated successfully.
ru: Участник продукта успешно изменен.

source: Edit Product Member
ru: Изменить участника продукта

source: Product member deleted successfully.
ru: Участник продукта успешно удален.

source: Delete Product Member
ru: Удалить участника продукта

source: API connection successful with message: %(result)s.
ru: Успешное подключение к API с сообщением: %(result)s.

source: API Scan Configuration added successfully.
ru: Конфигурация сканирования API успешно добавлена.

source: Add API Scan Configuration
ru: Добавить конфигурацию сканирования API

source: API Scan Configurations
ru: Настройки сканирования API

source: API Scan Configuration successfully updated.
ru: Настройки сканирования API успешно изменены.

source: Edit API Scan Configuration
ru: Изменить конфигурацию сканирования API

source: API Scan Configuration deleted.
ru: Конфигурация сканирования API удалена.

source: Delete Tool Configuration
ru: Удалить конфигурацию инструмента

source: You are not permitted to make groups owners.
ru: У вас не хватает прав на создание владельцев групп.

source: Product group updated successfully.
ru: Группа продуктов успешно обновлена.

source: Edit Product Group
ru: Изменить группу продуктов

source: Product group deleted successfully.
ru: Группа продуктов успешно удалена.

source: Delete Product Group
ru: Удалить группу продуктов

source: You are not permitted to add groups as owners.
ru: У вас не хватает прав на добавление групп в качестве владельцев.

source: Product groups added successfully.
ru: Группа продуктов успешно добавлена.

source: Product Type List
ru: Список типов продукта

source: Add Product Type
ru: Добавить тип продукта

source: Product type added successfully.
ru: Тип продукта успешно добавлен.

source: View Product Type
ru: Все типы продуктов

source: Previewing the relationships has been disabled.
ru: Предварительный просмотр связей был отключен.

source: Delete Product Type
ru: Удалить тип продукта

source: Product type updated successfully.
ru: Тип продукта успешно обновлен.

source: Product type members added successfully.
ru: Участник типа продукта успешно добавлен.

source: Add Product Type Member
ru: Добавить участника типа продукта

source: Edit Product Type Member
ru: Изменить участника типа продукта

source: There must be at least one owner for Product Type %(product_type_name)s.
ru: У типа продукта %(product_type_name)s должен быть как минимум один владелец.

source: Product type member updated successfully.
ru: Участник типа продукта успешно обновлен.

source: There must be at least one owner.
ru: Должен быть как минимум один владелец.

source: Product type member deleted successfully.
ru: Участник типа продукта успешно удален.

source: Product type groups added successfully.
ru: Группы типов продукта успешно добавлены.

source: Product type group updated successfully.
ru: Группа типов продукта успешно обновлена.

source: Product type group deleted successfully.
ru: Группа типов продукта успешно удалена.

source: Simple Search
ru: Простой поиск

source: Search
ru: Поиск

source: API v2 Key
ru: Ключ API v2

source: API v2 OpenAPI2 Docs (Deprecated)
ru: API v2 OpenAPI2 документация (устарело)

source: Documentation
ru: Документация

source: SAML Logout
ru: SAML выход

source: Logout
ru: Выйти

source: Dashboard
ru: Дашборд

source: Products
ru: Продукты

source: All Products
ru: Все продукты

source: Add Product
ru: Добавить продукт

source: All Product Types
ru: Все типы продуктов

source: Engagements
ru: Проверки

source: Active Engagements
ru: Активные проверки

source: Engagements by Product
ru: Проверки в проектах

source: Test Types
ru: Типы тестов

source: Environments
ru: Окружение

source: Open Findings
ru: Открытые уязвимости

source: All Findings
ru: Все уязвимости

source: Closed Findings
ru: Закрытые уязвимости

source: Risk Accepted Findings
ru: Уязвимости с принятым риском

source: Finding Templates
ru: Шаблоны уязвимостей

source: Components
ru: Компоненты

source: All Components
ru: Все компоненты

source: All Endpoints
ru: Все конечные точки

source: All Hosts
ru: Все хосты

source: Vulnerable Endpoints
ru: Уязвимые конечные точки

source: Vulnerable Hosts
ru: Уязвимые хосты

source: Migrate Endpoints
ru: Мигрировать конечные точки

source: Reports
ru: Отчёты

source: Metrics Dashboard
ru: Панель управления метриками

source: Product Type Metrics
ru: Метрики типа продукта

source: Product Type Counts
ru: Счетчик типов продукта

source: DT statistic
ru: Статистика DT

source: Users
ru: Пользователи

source: Groups
ru: Группы

source: Calendar
ru: Календарь

source: Questionnaires
ru: Анкетирование

source: All Questionnaires
ru: Все анкеты

source: All Questions
ru: Список вопросов

source: Configuration
ru: Конфигурация

source: Announcement
ru: Объявление

source: Credential Manager
ru: Менеджер учетных данных

source: Login Banner
ru: Баннер входа

source: Note Types
ru: Типы заметок

source: Notifications
ru: Уведомления

source: Regulations
ru: Регламенты

source: SLA Configuration
ru: Конфигурация SLA

source: System Settings
ru: Системные настройки

source: Tool Configuration
ru: Конфигурация инструмента

source: Tool Type
ru: Типы инструментов

source: Collapse Menu
ru: Свернуть меню

source: Overview
ru: Обзор

source: View Engagements
ru: Проверки

source: Add New Interactive Engagement
ru: Добавить новую интерактивную проверку

source: Add New CI/CD Engagement
ru: Новая CI/CD проверка

source: View Active Findings
ru: Активные уязвимости

source: View Active Verified Findings
ru: Активные подтвержденные уязвимости

source: View Critical Findings
ru: Критические Уязвимости

source: View Findings from Last 7 Days
ru: Уязвимости за последнюю неделю

source: View Risk Accepted Findings
ru: Уязвимости с принятым риском

source: View All Findings
ru: Все уязвимости

source: View Closed Findings
ru: Закрытые уязвимости

source: Add New Finding
ru: Добавить новую уязвимость

source: Import Scan Results
ru: Импорт результатов сканирования

source: View Endpoints
ru: Посмотреть конечные точки

source: View Hosts
ru: Просмотр хостов

source: View Vulnerable Endpoints
ru: Посмотреть уязвимые точки

source: View Vulnerable Hosts
ru: Просмотреть уязвимые хосты

source: Endpoint Report
ru: Отчет о конечных точках

source: Add New Endpoint
ru: Добавить новую конечную точку

source: Import Endpoint Meta
ru: Импорт данных

source: Settings
ru: Настройки

source: Edit
ru: Редактировать

source: Add Custom Fields
ru: Добавление произвольного поля

source: Edit Custom Fields
ru: Редактировать произвольные поля

source: View API Scan Configurations
ru: Просмотреть конфигурации сканирования API

source: Add Product Tracking Files
ru: Добавить файлы для отслеживания

source: View Product Tracking Files
ru: Просмотр файлов для отслеживания

source: Add Credentials
ru: Добавить учетные данные

source: View Credentials
ru: Посмотреть учётные данные

source: Add Tools
ru: Добавить инструменты

source: View Tools
ru: Посмотреть инструменты

source: Add Engagement Presets
ru: Добавить шаблоны проверок

source: View Engagement Presets
ru: Шаблоны проверки

source: View History
ru: Посмотреть историю

source: Delete
ru: Удалить

source: See All Alerts
ru: Посмотреть все оповещения

source: Clear All Alerts
ru: Очистить все оповещения

source: No alerts found
ru: Уведомления не найдены

source: Default Information
ru: Информация по умолчанию

source: Additional Contact Information
ru: Дополнительная контактная информация

source: Global Role
ru: Глобальная Роль

source: Submit
ru: Отправить

source: Type
ru: Тип

source: Source
ru: Источник

source: Timeframe
ru: Период

source: Select all visible alerts
ru: Выбрать все видимые уведомления

source: Remove selected
ru: Удалить выбранное

source: No alerts found.
ru: Уведомления не найдены.

source: Your current API key is
ru: Текущий ключ API

source: Your current API Authorization Header value is
ru: Текущее значение заголовка авторизации API

source: Has your key been exposed? Are you ready for a new one?
ru: Ваш ключ был скомпрометирован? Хотите получить новый?

source: Generate New Key
ru: Сформировать новый ключ

source: Alternatively, you can use /api/v2/api-token-auth/ to get your token. Example:
ru: Вы можете использовать /api/v2/api-token-auth/ для получения токена. Пример:

source: To use your API Key you need to specify an Authorization header. Example:
ru: Для использования ключа API необходимо указать заголовок авторизации. Пример:

source: Here is a simple python example against the /users endpoint
ru: Вот простой пример использования конечной точки /users на языке python

source: Target Level
ru: Целевой уровень

source: Target ASVS Level for this application.
ru: Целевой ASVS уровень для этого приложения.

source: Publish
ru: Опубликовать

source: Publish will display the ASVS Level on the product and other areas in DefectDojo. Check this once you have completed the assessment.
ru: Публикация покажет уровень ASVS в продукте и в других областях в DefectDojo. Отметьте это поле, как только закончите оценку.

source: View All
ru: Посмотреть все

source: Applicable
ru: Применимо

source: Is applicable?
ru: Применимо?

source: Is passed?
ru: Пройдено?

source: No benchmarks found.
ru: Ориентиры не найдены.

source: Close
ru: Закрыть

source: Benchmark Notes
ru: Комментарий к пункту

source: There is no notes yet.
ru: Заметок пока нет.

source: Notes:
ru: Заметки:

source: Add Note
ru: Добавить Заметку

source: Are you sure?
ru: Вы уверены?

source: Change Password
ru: Изменить пароль

source: %(name)s for %(start_date)s - %(end_date)s
ru: %(name)s для %(start_date)s - %(end_date)s

source: Measures Findings
ru: Показатели по находкам

source: Measure Affected Endpoints
ru: Показатели по затронутым конечным точкам

source: Open Bug Count by Month
ru: Количество найденных ошибок по месяцам

source: Risk Accepted Bug Count by Month
ru: Количество ошибок с принятым риском по месяцам

source: Open Bug Count by Week
ru: Количество найденных ошибок по неделям

source: Risk Accepted Bug Count by Week
ru: Количество ошибок с принятым риском по неделям

source: Top %(length)s Products By Bug Severity
ru: Топ %(length)s продуктов по критичности ошибок

source: Total Findings In Period By Severity
ru: Всего находок за период по критичности

source: Total Findings Risk Accepted In Period By Severity
ru: Всего находок с принятым риском за период по критичности

source: Total Findings Closed In Period By Severity
ru: Всего находок закрыто за период по критичности

source: Weekly activity, displayed by day, of findings reported.*
ru: Еженедельная активность с разбивкой по дням о сообщенных находках.*

source: Week begins on date displayed.
ru: Дата начала недели.

source: * Weeks are only displayed if findings are available.
ru: * Недели отображаются только при наличии находок.

source: View Engagement Details
ru: Подробности

source: Last Seven Days
ru: Обнаружено за последние 7 дней

source: View Finding Details
ru: Подробности

source: Closed In Last Seven Days
ru: Закрыто за последние 7 дней

source: Risk Accepted In Last Seven Days
ru: Принято рисков за последние 7 дней

source: Historical Finding Severity
ru: Находки за все время (по уровню критичности)

source: Reported Finding Severity by Month
ru: Обнаружено находок за месяц (по уровню критичности)

source: Unassigned Answered Engagement Questionnaires
ru: Не назначенные анкеты для участия с ответами

source: Name
ru: Название

source: Engagement
ru: Проверка

source: Responder
ru: Исполнитель

source: Status
ru: Статус

source: Completion
ru: Прогресс

source: Actions
ru: Действия

source: Anonymous
ru: Анонимно

source: Completed
ru: Завершено

source: Unanswered
ru: Без ответа

source: View Responses
ru: Просмотр ответов

source: Assign User
ru: Назначить пользователя

source: Create Engagement
ru: Создать проверку

source: No questionnaires found.
ru: Анкеты не найдены.
