Repository: VYACHESLAV204/newDjangoDefect
Catalog: dojo/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Password must contain at least 1 lowercase letter, a-z.
ru: Пароль должен содержать хотя бы одну строчную букву, a-z.

source: The password must contain at least 1 special character, ()[]{}|\`~!@#$%^&*_-+=;:'",<>./?.
ru: Пароль должен содержать хотя бы один символ, ()[]{}|\`~!@#$%^&*_-+=;:'",<>./?.

source: Hello {name}! Your last login was {naturaltime(last_login)} ({last_login.strftime("%Y-%m-%d %I:%M:%S %p")})
ru: Здравствуйте {name}! Ваш последний вход был {naturaltime(last_login)} ({last_login.strftime("%Y-%m-%d %I:%M:%S %p")})

source: API Key generated successfully.
ru: Ключ API успешно сгенерирован.

source: You have logged out successfully.
ru: Вы успешно вышли из системы.

source: Alerts removed.
ru: Оповещения удалены.

source: Only superusers are allowed to change their global role.
ru: Только суперпользователи могут изменять свою глобальную роль.

source: Profile updated successfully.
ru: Профиль успешно обновлен.

source: User Profile - %(user_full_name)s
ru: Профиль пользователя - %(user_full_name)s

source: Your password has been changed.
ru: Ваш пароль был изменен.

source: All Users
ru: Все пользователи

source: Add User
ru: Добавить пользователя

source: Only superusers are allowed to add superusers. User was not saved.
ru: Только суперпользователи могут добавлять суперпользователей. Пользователь не был сохранен.

source: Only superusers are allowed to add users with a global role. User was not saved.
ru: Только суперпользователи могут добавлять пользователей с глобальной ролью. Пользователь не был сохранен.

source: User added successfully.
ru: Пользователь успешно добавлен.

source: User was not added successfully.
ru: Пользователь не был успешно добавлен.

source: View User
ru: Просмотр пользователя

source: Edit User
ru: Редактировать пользователя

source: Only superusers are allowed to edit superusers. User was not saved.
ru: Только суперпользователи могут редактировать суперпользователей. Пользователь не был сохранен.

source: Only superusers are allowed to edit users with a global role. User was not saved.
ru: Только суперпользователи могут редактировать пользователей с глобальной ролью. Пользователь не был сохранен.

source: User saved successfully.
ru: Пользователь успешно сохранен.

source: User was not saved successfully.
ru: Пользователь не был успешно сохранен.

source: You may not delete yourself.
ru: Вы не можете удалить себя.

source: Only superusers are allowed to delete superusers. User was not removed.
ru: Только суперпользователи могут удалять суперпользователей. Пользователь не был удален.

source: Only superusers are allowed to delete users with a global role. User was not removed.
ru: Только суперпользователи могут удалять пользователей с глобальной ролью. Пользователь не был удален.

source: User and relationships removed.
ru: Пользователь и его связи удалены.

source: User cannot be deleted: %(error)s
ru: Пользователь не может быть удален: %(error)s

source: Groups added successfully.
ru: Группы успешно добавлены.

source: Add Group Member
ru: Добавить участника группы

source: Permissions updated.
ru: Права доступа обновлены.

source: Home
ru: Главная
