Repository: VYACHESLAV204/newDjangoDefect
Catalog: dojo/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Announcement removed for everyone.
ru: Объявление удалено для всех пользователей.

source: Announcement updated successfully.
ru: Объявление успешно обновлено.

source: Announcement Configuration
ru: Настройка объявлений

source: Announcement removed.
ru: Объявление удалено.

source: Failed to remove announcement.
ru: Не удалось удалить объявление.

source: Expected a list of items but got type "{input_type}".
ru: Ожидался список элементов, но получил тип "{input_type}".

source: Invalid json list. A tag list submitted in string form must be valid json.
ru: Неверный список json. Список тегов должен быть в формате json.

source: All list items must be of string type.
ru: Все элементы списка должны иметь тип строки.

source: All list items must be of dict type with keys 'request' and 'response'
ru: Все элементы списка должны иметь тип dict с ключами 'request' и 'response'

source: All values in the dict must be of string type.
ru: Все значения в dict должны иметь тип строки.

source: Benchmarks
ru: Бенчмарки

source: Benchmarks removed.
ru: Бенчмарки удалены.

source: Delete Benchmarks
ru: Удалить бенчмарки

source: Any
ru: Любой

source: Open
ru: Открыть

source: Verified
ru: Подтвержден

source: Inactive
ru: Неактивно

source: Risk Accepted
ru: Риск принят

source: Closed
ru: Закрыт

source: Under Review
ru: На рассмотрении

source: False
ru: Нет

source: True
ru: Да

source: Any date
ru: Любая дата

source: Today
ru: Сегодня

source: Past 7 days
ru: За последние 7 дней

source: Past 30 days
ru: За последние 30 дней

source: Past 90 days
ru: За последние 90 дней

source: Current month
ru: Текущий месяц

source: Current year
ru: Текущий год

source: Past year
ru: За последний год

source: Next 7 days
ru: Следующие 7 дней

source: Next 30 days
ru: Следующие 30 дней

source: Next 90 days
ru: Следующие 90 дней

source: Next year
ru: Следующий год

source: Either
ru: Всегда

source: Yes
ru: Да

source: No
ru: Нет

source: Was
ru: Был

source: Past 6 Months
ru: Последние полгода

source: Planned remediation version
ru: Запланированная версия исправления

source: Text Question
ru: Текст вопроса

source: Choice Question
ru: Вопрос с выбором

source: Select valid choice: Low,Medium,High
ru: Выберите корректное значение: Низкий, Средний, Высокий

source: Start date
ru: Дата начала

source: End date
ru: Дата окончания

source: Product type
ru: Тип продукта

source: Product
ru: Продукт

source: Dismissable?
ru: Можно скрыть?

source: Ticking this box allows users to dismiss the current announcement
ru: Позволяет пользователям закрыть текущее объявление, чтобы оно больше не отображалось

source: Critical Product Metrics
ru: Критические метрики продукта

source: All objects have been filtered away. Displaying all objects
ru: Все объекты были отфильтрованы. Отображение всех объектов

source: Metrics
ru: Метрики

source: %(product_type)s Metrics
ru: Метрики %(product_type)s

source: Product Type Metrics by Findings
ru: Метрики Типа продукта по Находкам

source: Product Type Metrics by Affected Endpoints
ru: Метрики типа продукта по затронутым конечным точкам

source: %(team_name)s Metrics
ru: Метрики %(team_name)s

source: Simple Metrics
ru: Простые метрики

source: Please choose month and year and the Product Type.
ru: Пожалуйста, выберите месяц, год и Тип продукта.

source: Bi-Weekly Metrics
ru: BI метрики

source: Engineer Metrics
ru: Метрики по пользователям

source: Privacy
ru: Личные данные

source: Finance
ru: Финансы

source: Education
ru: Образование

source: Medical
ru: Медицина

source: Corporate
ru: Корпоративный

source: Other
ru: Прочие

source: The name of the regulation.
ru: Название правила.

source: A shortened representation of the name.
ru: Краткое представление названия.

source: The subject of the regulation.
ru: Предмет правила.

source: The territory over which the regulation applies.
ru: Территория, на которой распространяется регулирование.

source: Information about the regulation's purpose.
ru: Информация о предназначении данного положения.

source: An external URL for more information.
ru: Внешний URL для дополнительной информации.

source: Phone number must be entered in the format: '+999999999'. Up to 15 digits allowed.
ru: Номер телефона должен быть введен в формате: '+9999999'. Допускается до 15 цифр.

source: Email address associated with your slack account
ru: Адрес электронной почты, связанный с вашим аккаунтом Slack

source: Slack Email Address
ru: Адрес электронной почты Slack

source: Instead of async deduping a finding the findings will be deduped synchronously and will 'block' the user until completion.
ru: Вместо асинхронной дедупликации уязвимостей, дедупликация будет проходить синхронно и "блокировать" пользователя до завершения.

source: Forces this user to reset their password on next login.
ru: Принудительно сбросить пароль этого пользователя при следующем входе в систему.

source: Enable audit logging
ru: Включить журнал аудита

source: With this setting turned on, Dojo maintains an audit log of changes made to entities (Findings, Tests, Engagements, Procuts, ...)If you run big import you may want to disable this because the way django-auditlog currently works, there's a big performance hit. Especially during (re-)imports.
ru: При включении данной опции, Dojo ведет журнал аудита изменений сущностей (уязвимостей, тестов, проверок, продуктов, ...). Если вы импортируете большие объемы данных, будет лучше отключить данную настройку, чтобы избежать проблем с производительностью. Особенно во время (ре)импорта.

source: Deduplicate findings
ru: Дедупликация уязвимостей

source: With this setting turned on, Dojo deduplicates findings by comparing endpoints, cwe fields, and titles. If two findings share a URL and have the same CWE or title, Dojo marks the less recent finding as a duplicate. When deduplication is enabled, a list of deduplicated findings is added to the engagement view.
ru: При включении данного параметра, Dojo дедуплицирует уязвимости посредством сравнения эндпоинтов, cwe и заголовков. Если две уязвимости имеют общий URL и схожие CWE или заголовок, то Dojo пометит последнюю как дубликат. Когда дедупликация включена, список продублированных уязвимостей добавляется на страницу Проверки.

source: Requires next setting: maximum number of duplicates to retain.
ru: Требуется указать параметр: максимальное количество хранимых дубликатов.

source: Max Duplicates
ru: Макс. дубликатов

source: When enabled, if a single issue reaches the maximum number of duplicates, the oldest will be deleted. Duplicate will not be deleted when left empty. A value of 0 will remove all duplicates.
ru: Когда включено, если задача достигает максимального количества дубликатов, то самые старые будут удаляться. Дубликаты не будут удаляться, если оставить значение пустым. При значении "0" будут удаляться все дубликаты.

source: Enable JIRA integration
ru: Включить интеграцию с JIRA

source: Enable JIRA web hook
ru: Включить веб-хук JIRA

source: Please note: It is strongly recommended to use a secret below and / or IP whitelist the JIRA server using a proxy such as Nginx.
ru: Пожалуйста, обратите внимание: настоятельно рекомендуется использовать секретный ключ ниже и / или белый список IP серверов JIRA с использованием прокси-сервера, например Nginx.

source: Disable web hook secret
ru: Отключить секретный ключ для веб хука

source: Allows incoming requests without a secret (discouraged legacy behaviour)
ru: Разрешает входящие запросы без использования секретного ключа (не рекомендуемое поведение)

source: Secret needed in URL for incoming JIRA Webhook
ru: Секретный ключ, необходимый в URL для входящего JIRA Webhook

source: JIRA issue labels space seperated
ru: Разделенные пробелом метки задач JIRA

source: Add vulnerability Id as a JIRA label
ru: Добавить идентификатор уязвимости в качестве заголовка JIRA

source: Enable GITHUB integration
ru: Включить интеграцию с GitHub

source: Enable Slack notifications
ru: Включить уведомления Slack

source: Optional. Needed if you want to send global notifications.
ru: Необязательно. Требуется, если вы хотите отправлять глобальные уведомления.

source: Token required for interacting with Slack. Get one at https://api.slack.com/tokens
ru: Токен необходим для взаимодействия со Slack. Получите его на https://api.slack.com/tokens

source: Optional. Will take your bot name otherwise.
ru: Необязательно. В противном случае будет использоваться имя вашего бота.

source: Enable Microsoft Teams notifications
ru: Включить уведомления в Microsoft Teams

source: The full URL of the incoming webhook
ru: Полный URL-адрес входящего веб хука

source: (EXPERIMENTAL) DefectDojo will automatically mark the finding as a false positive if an equal finding (according to its dedupe algorithm) has been previously marked as a false positive on the same product. ATTENTION: Although the deduplication algorithm is used to determine if a finding should be marked as a false positive, this feature will not work if deduplication is enabled since it doesn't make sense to use both.
ru: (ЭКСПЕРИМЕНТАЛЬНО) DefectDojo будет автоматически помечать находки как false positive, если аналогичная находка (на основе алгоритма дедупликации) была ранее помечена как false positive в том же продукте. ВНИМАНИЕ: Хотя алгоритм дедупликации используется для пометки находки как false positive, эта функция не будет работать, если дедупликация включена, поскольку использовать обе функции одновременно не имеет смысла.

source: (EXPERIMENTAL) FP History will also retroactively mark/unmark all existing equal findings in the same product as a false positives. Only works if the False Positive History feature is also enabled.
ru: (ЭКПЕРИМЕНТАЛЬНО) FP History также будет задним числом ставить/снимать отметку false positive со всех существующих сопоставимых находок в продукте. Работает только в том случае, если функция False Positive History включена.

source: URL prefix if DefectDojo is installed in it's own virtual subdirectory.
ru: Префикс URL, если DefectDojo установлен в свой виртуальный подкаталог.

source: Enable Product Grading
ru: Включить оценку продукта

source: Displays a grade letter next to a product to show the overall health.
ru: Отображает буквы оценки рядом с продуктом, показывающие общий уровень защищенности.

source: Grade A
ru: Оценка A

source: Percentage score for an 'A' >=
ru: Процент баллов для 'A' >=

source: Grade B
ru: Оценка Б

source: Percentage score for a 'B' >=
ru: Процент балла для 'B' >=

source: Grade C
ru: Оценка С

source: Percentage score for a 'C' >=
ru: Процент баллов для 'C' >=

source: Grade D
ru: Оценка D

source: Percentage score for a 'D' >=
ru: Процент баллов для 'D' >=

source: Grade F
ru: Оценка F

source: Percentage score for an 'F' <=
ru: Процент баллов для 'F' <=

source: Enable Product Tag Inheritance
ru: Включить наследование тегов продуктов

source: Enables product tag inheritance globally for all products. Any tags added on a product will automatically be added to all Engagements, Tests, and Findings
ru: Включение наследование тегов продуктами глобально для всех продуктов. Любые теги, добавленные в продукт будут автоматически добавлены во все Проверки, Тесты и Находки

source: Enable Benchmarks
ru: Включить бенчмарки

source: Enables Benchmarks such as the OWASP ASVS (Application Security Verification Standard)
ru: Включает бенчмарки, такие как OWASP ASVS

source: Enable Remediation Advice
ru: Включить консультации по исправлению

source: Enables global remediation advice and matching on CWE and Title. The text will be replaced for mitigation, impact and references on a finding. Useful for providing consistent impact and remediation advice regardless of the scanner.
ru: Позволяет использовать глобальные советы по восстановлению и сопоставление по CWE и названию. Текст будет заменен для "Митигирования", "Импакта", и ссылок на недостаток. Полезно для обеспечения консистентного значения поля "Импакт" и "Совета по исправлению", независимо от сканера.

source: Enable Engagement Auto-Close
ru: Включить автоматическое закрытие Проверок

source: Closes an engagement after 3 days (default) past due date including last update.
ru: Закрывает Проверку через 3 дня (по умолчанию) после истечения срока, включая последнее обновление.

source: Engagement Auto-Close Days
ru: Дней до автоматического закрытия Проверки

source: Closes an engagement after the specified number of days past due date including last update.
ru: Закрытие проверки по прошествии указанного числа дней с момента истечения срока, включая последнее обновление.

source: Enable Handmade Engagement Auto-Delete
ru: Включить автоматическое удаление ручных проверок

source: Delete an engagement after 30 days (default) after creation date.
ru: Удалять проверки через 30 дней (по умолчанию) после даты создания.

source: Handmade Engagement Auto-Delete Days
ru: Дней до автоматического удаления ручных проверок

source: Delete an engagement after the specified number of days after creation date.
ru: Удалять проверки после определенного количества дней после даты создания.

source: Enable Finding SLA's
ru: Включить SLA для уязвимостей

source: Enables Finding SLA's for time to remediate.
ru: Включение SLA Находки на время исправления.

source: Enable Notify SLA's Breach for active Findings
ru: Включить оповещения о нарушении SLA для активных Находок

source: Enables Notify when time to remediate according to Finding SLA's is breached for active Findings.
ru: Включение оповещения, когда нарушено время на исправление SLA Находки для активных Находок.

source: Enable Notify SLA's Breach for active, verified Findings
ru: Включить оповещение о нарушении SLA для активных и подтвержденных Находок

source: Enables Notify when time to remediate according to Finding SLA's is breached for active, verified Findings.
ru: Включение оповещения, когда наступило время на исправление нарушения SLA Находки для активных и подтвержденных Находок.

source: Enable Notify SLA's Breach only for Findings linked to JIRA
ru: Включить оповещение о нарушении SLA только для Находок связанных с JIRA

source: Enables Notify when time to remediate according to Finding SLA's is breached for Findings that are linked to JIRA issues. Notification is disabled for Findings not linked to JIRA issues
ru: Включение оповещения, когда наступило время на исправление нарушения SLA Находки, которая связана с задачей в JIRA. Оповещение отключено для Находок не связанных с задачами в JIRA

source: Enable an exponential backoff strategy for SLA breach notifications.
ru: Включить экспоненциальную стратегию отсрочки для оповещений о нарушении SLA.

source: Enable an exponential backoff strategy for SLA breach notifications, e.g. 1, 2, 4, 8, etc. Otherwise it alerts every day
ru: Включить экспоненциальную стратегию отсрочки для оповещений о нарушении SLA (например 1, 2, 4, 8 и т.д.). В противном случае оповещение будет приходить каждый день

source: Allow Anonymous Survey Responses
ru: Разрешить анонимные ответы на опросник

source: Enable anyone with a link to the survey to answer a survey
ru: Разрешить любому, кто имеет ссылку на опросник, ответить на вопрос

source: Custom Disclaimer
ru: Пользовательский отказ от ответственности

source: Include this custom disclaimer on all notifications and generated reports
ru: Включить этот пользовательский отказ от ответственности во все оповещения и сгенерированные отчеты

source: Default expiry period for risk acceptance form.
ru: Срок действия по умолчанию для формы принятия рисков.

source: Risk acceptance expiration heads up days
ru: Количество дней до истечения срока принятия риска

source: Notify X days before risk acceptance expires. Leave empty to disable.
ru: Уведомлять X дней до истечения срока действия риска. Оставьте пустым, чтобы отключить.

source: Enable credentials
ru: Включить учетные данные

source: With this setting turned off, credentials will be disabled in the user interface.
ru: Если эта настройка выключена, то учетные данные будут отключены в пользовательском интерфейсе.

source: Enable questionnaires
ru: Включить опросники

source: With this setting turned off, questionnaires will be disabled in the user interface.
ru: Если этот параметр выключен, опросники будут отключены в пользовательском интерфейсе.

source: Enable checklists
ru: Включить чеклист

source: With this setting turned off, checklists will be disabled in the user interface.
ru: Если этот параметр выключен, чек-листы будут отключены в пользовательском интерфейсе.

source: Enable Endpoint Metadata Import
ru: Включить импорт метаданных конечной точки

source: With this setting turned off, endpoint metadata import will be disabled in the user interface.
ru: Если эта настройка выключена, импорт метаданных конечных точек будет отключен в пользовательском интерфейсе.

source: Enable user profile for writing
ru: Включить изменение профиля пользователя

source: When turned on users can edit their profiles
ru: Если включено, то пользователи могут редактировать свои профили

source: Enable Product Tracking Files
ru: Включить отслеживание файлов в продукте

source: With this setting turned off, the product tracking files will be disabled in the user interface.
ru: Если эта настройка выключена, файлы отслеживания продукта будут отключены в пользовательском интерфейсе.

source: Enable Finding Groups
ru: Включить группы Находок

source: With this setting turned off, the Finding Groups will be disabled.
ru: Если эта настройка выключена, группы Находок будут отключены.

source: Enable Calendar
ru: Включить календарь

source: With this setting turned off, the Calendar will be disabled in the user interface.
ru: Если эта настройка выключена, календарь будет отключен в пользовательском интерфейсе.

source: New users will be assigned to this group.
ru: Новые пользователи будут назначены в эту группу.

source: New users will be assigned to their default group with this role.
ru: Новые пользователи будут назначены в их группу по умолчанию с этой ролью.

source: New users will only be assigned to the default group, when their email address matches this regex pattern. This is optional condition.
ru: Новые пользователи будут назначены в группу по умолчанию только в том случает, если их email соответствует этому шаблону. Это необязательное условие.

source: Minimum password length
ru: Минимальная длина пароля

source: Requires user to set passwords greater than minimum length.
ru: Требует от пользователя задания паролей больше минимальной длины.

source: Maximum password length
ru: Максимальная длина пароля

source: Requires user to set passwords less than maximum length.
ru: Требует от пользователя установки паролей меньше максимальной длины.

source: Password must contain one digit
ru: Пароль должен содержать одну цифру

source: Requires user passwords to contain at least one digit (0-9).
ru: Требует, чтобы пароли пользователей содержали как минимум одну цифру (0-9).

source: Password must contain one special character
ru: Пароль должен содержать один специальный символ

source: Requires user passwords to contain at least one special character (()[]{}|\`~!@#$%^&*_-+=;:'",<>./?).
ru: Требует, чтобы пароли пользователей содержали как минимум один специальный символ (()[]{}|\`~!@#$%^&*_-+=;:'",<>./?).

source: Password must contain one lowercase letter
ru: Пароль должен содержать одну строчную букву

source: Requires user passwords to contain at least one lowercase letter (a-z).
ru: Требует, чтобы пароли пользователей содержали как минимум одну строчную букву (a-z).

source: Password must contain one uppercase letter
ru: Пароль должен содержать одну заглавную букву

source: Requires user passwords to contain at least one uppercase letter (A-Z).
ru: Требует, чтобы пароли пользователей содержали как минимум одну заглавную букву (A-Z).

source: Password must not be common
ru: Пароль не должен быть типичным

source: Requires user passwords to not be part of list of common passwords.
ru: Требует, чтобы пароли пользователей не входили в список типичных паролей.

source: This role determines the permissions of the user to manage the group.
ru: Эта роль определяет права пользователя на управление группой.

source: Group role
ru: Роль в группе

source: The global role will be applied to all product types and products.
ru: Глобальная роль будет применяться ко всем проектам и типам проектов.

source: Global role
ru: Глобальная роль

source: Custom SLA Name
ru: Название пользовательского SLA

source: A unique name for the set of SLAs.
ru: Уникальное название для набора SLA.

source: Critical Finding SLA Days
ru: SLA дней на исправление критической находки

source: number of days to remediate a critical finding.
ru: количество дней на исправление критической находки.

source: High Finding SLA Days
ru: SLA дней на исправление находки высокой важности

source: number of days to remediate a high finding.
ru: количество дней на исправление находки высокой важности.

source: Medium Finding SLA Days
ru: SLA дней на исправление находки средней важности

source: number of days to remediate a medium finding.
ru: количество дней на исправление находки средней важности.

source: Low Finding SLA Days
ru: SLA дней на исправление находки низкой важности

source: number of days to remediate a low finding.
ru: количество дней на исправление находки низкой важности.

source: Desktop
ru: Настольный

source: Internet of Things
ru: Интернет вещей

source: Mobile
ru: Мобильный

source: Web
ru: Веб

source: Construction
ru: В разработке

source: Production
ru: На бою

source: Retirement
ru: Выведено из эксплуатации

source: Third Party Library
ru: Сторонняя библиотека

source: Purchased
ru: Приобретено

source: Contractor Developed
ru: Разработано подрядчиком

source: Internally Developed
ru: Внутренняя разработка

source: Outsourced
ru: Аутсорсинг

source: Very High
ru: Очень высокий

source: High
ru: Высокий

source: Medium
ru: Средний

source: Low
ru: Низкий

source: Very Low
ru: Очень низкий

source: None
ru: Нет

source: Estimate the number of user records within the application.
ru: Оцените количество записей пользователей в приложении.

source: Estimate the application's revenue.
ru: Оцените доход приложения.

source: Specify if the application is used by people outside the organization.
ru: Укажите, используется ли приложение лицами, не входящими в организацию.

source: Specify if the application is accessible from the public internet.
ru: Укажите, доступно ли приложение через интернет.

source: Add tags that help describe this product. Choose from the list or add new tags. Press Enter key to add.
ru: Добавьте теги, которые помогут описать этот товар. Выберите из списка или добавьте новые теги. Нажмите клавишу Enter для добавления.

source: Enables product tag inheritance. Any tags added on a product will automatically be added to all Engagements, Tests, and Findings
ru: Включает наследование тегов в продукте. Любые теги, добавленные в продукт будут автоматически добавлены во все Проверки, Тесты и Находки

source: Allows simple risk acceptance by checking/unchecking a checkbox.
ru: Позволяет принимать простые риски включением/отключением флажка.

source: Allows full risk acceptance using a risk acceptance form, expiration date, uploaded proof, etc.
ru: Разрешает полное принятие риска используя форму принятия риска, дату истечения срока действия, загруженные доказательства и т. д.

source: Disable SLA breach notifications
ru: Отключить уведомления о нарушениях SLA

source: Disable SLA breach notifications if configured in the global settings
ru: Отключить уведомления о нарушениях SLA, если это указано в глобальных настройках

source: Additional definitions that will be consumed by scanner
ru: Дополнительные параметры, которые будут использованы сканером

source: Title for SSH/API Key
ru: Название для SSH/API ключа
